# 하지만 미국은 한국과 사용하는 단위 체계가 다르다. 한국은 미터법을 사용하지만, 미국은 미국 단위계를 사용한다. 싸이를 위해 단위를 바꾸어 주는 프로그램을 작성하시오.

# 아래 표를 참고해서 계산하면 되고, 킬로그램 <-> 파운드, 리터 <-> 갤런만 변환하면 된다.

# 종류	미터법	미국 단위계
# 무게	1.000 킬로그램	2.2046 파운드
#  	0.4536 킬로그램	1.0000 파운드
# 부피	1.0000 리터	0.2642 갤런
#  	3.7854 리터	1.0000 갤런
# 입력
# 첫째 줄에 테스트 케이스의 개수 T(1<=T<=1,000)가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있다. 첫 번째 숫자는 값이고, 두 번째 등장하는 문자는 단위이다. 값은 소수일 수도 있고, 이 경우 소수점 아래 최대 넷째 자리까지 주어진다. 단위는 kg, lb, l, g 중 하나이며, 순서대로 킬로그램, 파운드, 리터, 갤런이다.

# 출력
# 각 테스트 케이스에 대해서 바꾼 값과 단위를 출력한다. 값은 반올림해서 소수점 4째자리까지 출력한다. 단위는 kg, lb, l, g중 하나이며, 설명은 입력 설명에 있다.


import sys
n = int(sys.stdin.readline())
for i in range(n):
    n,t = map(str,sys.stdin.readline().split())
    n = float(n)
    if t == 'kg':
        n = n*(2.2046)
        print('%.4f'%n,'lb')
    elif t == 'lb':
        n = n*(0.4536)
        print('%.4f'%n,'kg')
    elif t == 'l':
        n = n*0.2642
        print('%.4f'%n,'g')
    elif t == 'g':
        n = n*3.7854
        print('%.4f'%n,'l')
